#### Terraform Plan 📖
```
Acquiring state lock. This may take a few moments...
aws_acm_certificate.cloudfront: Refreshing state... [id=arn:aws:acm:us-east-1:079760567374:certificate/e0baf0ab-0cce-4b10-b4c7-17a5a7344e2d]
data.aws_caller_identity.current: Reading...
aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=EM96K1O06AY7Q]
aws_vpc.main: Refreshing state... [id=vpc-0075e337704a30cff]
aws_acm_certificate.alb: Refreshing state... [id=arn:aws:acm:ap-northeast-1:079760567374:certificate/98dcc2b0-50a0-4921-906a-2110705ba31e]
data.aws_ami.amazon_linux_2023: Reading...
aws_iam_role.ec2_ssm: Refreshing state... [id=care-shift-v3-ec2-ssm]
data.aws_caller_identity.current: Read complete after 0s [id=079760567374]
aws_s3_bucket.frontend: Refreshing state... [id=care-shift-v3-frontend-079760567374]
aws_iam_role_policy_attachment.ec2_ssm: Refreshing state... [id=care-shift-v3-ec2-ssm-20260225083115807200000001]
aws_iam_instance_profile.ec2_ssm: Refreshing state... [id=care-shift-v3-ec2-ssm]
data.aws_ami.amazon_linux_2023: Read complete after 1s [id=ami-099da3c6c9e8abd22]
aws_route_table.private: Refreshing state... [id=rtb-002667e41ff20336a]
aws_subnet.private_ec2_1a: Refreshing state... [id=subnet-03001749001d5ea4d]
aws_subnet.private_rds_1c: Refreshing state... [id=subnet-007922faef242b4aa]
aws_internet_gateway.main: Refreshing state... [id=igw-01250a20da03faa38]
aws_subnet.private_rds_1a: Refreshing state... [id=subnet-007d98cfa8d79482a]
aws_subnet.private_ec2_1c: Refreshing state... [id=subnet-0af1ec33c96958657]
aws_security_group.alb: Refreshing state... [id=sg-0f5a4a1025be8ba3d]
aws_lb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:targetgroup/care-shift-v3-tg/943b55fa69d68f89]
aws_subnet.public_1a: Refreshing state... [id=subnet-09bc82ef4aa70d802]
aws_subnet.public_1c: Refreshing state... [id=subnet-0d8695d22adefcc62]
aws_security_group.ec2: Refreshing state... [id=sg-04997652dc2d94873]
aws_route_table_association.private_rds_1c: Refreshing state... [id=rtbassoc-057ff39173b304667]
aws_route_table.public: Refreshing state... [id=rtb-02adecbdb1bb50434]
aws_security_group.rds: Refreshing state... [id=sg-0cc3e80e9b72381f7]
aws_route_table_association.private_ec2_1a: Refreshing state... [id=rtbassoc-0ef8390bcd57a934c]
aws_route_table_association.private_ec2_1c: Refreshing state... [id=rtbassoc-016e7795f752550fc]
aws_instance.app: Refreshing state... [id=i-096f51353422d3c2b]
aws_route_table_association.private_rds_1a: Refreshing state... [id=rtbassoc-0e5d221725c9646cf]
aws_db_subnet_group.main: Refreshing state... [id=care-shift-v3-db-subnet-group]
aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=care-shift-v3-frontend-079760567374]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:loadbalancer/app/care-shift-v3-alb/a1484a76bce47e89]
aws_cloudfront_distribution.main: Refreshing state... [id=E1ESAJ6Y0HJ7G0]
aws_route_table_association.public_1a: Refreshing state... [id=rtbassoc-02c954ff7eed97388]
aws_route_table_association.public_1c: Refreshing state... [id=rtbassoc-03280963c414b388f]
aws_s3_bucket_policy.frontend: Refreshing state... [id=care-shift-v3-frontend-079760567374]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:listener/app/care-shift-v3-alb/a1484a76bce47e89/6f7e63656ff45855]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:listener/app/care-shift-v3-alb/a1484a76bce47e89/96e42fc30fb85787]
aws_db_instance.main: Refreshing state... [id=db-IAMXNR2HMM7K5OBDPROJND4FTM]
aws_lb_target_group_attachment.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:targetgroup/care-shift-v3-tg/943b55fa69d68f89-20260226080151694500000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.frontend_s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "frontend_s3" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::care-shift-v3-frontend-079760567374/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::079760567374:distribution/E1ESAJ6Y0HJ7G0",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.main will be updated in-place
  ~ resource "aws_cloudfront_distribution" "main" {
        id                             = "E1ESAJ6Y0HJ7G0"
        tags                           = {
            "Name" = "care-shift-v3-cdn"
        }
        # (21 unchanged attributes hidden)

      ~ default_cache_behavior {
          + response_headers_policy_id = (known after apply)
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (7 unchanged blocks hidden)
    }

  # aws_cloudfront_response_headers_policy.frontend_csp will be created
  + resource "aws_cloudfront_response_headers_policy" "frontend_csp" {
      + arn     = (known after apply)
      + comment = "CSP for frontend assets served by CloudFront"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "care-shift-v3-frontend-csp"

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "default-src 'self'; script-src 'self'; style-src 'self' 'unsafe-inline' https://fonts.googleapis.com; img-src 'self'; font-src 'self' https://fonts.gstatic.com; connect-src 'self' https://www.ryuuichi-app.com wss://www.ryuuichi-app.com; object-src 'none'; base-uri 'self'; frame-ancestors 'self';"
              + override                = true
            }
        }
    }

  # aws_s3_bucket_policy.frontend will be updated in-place
  ~ resource "aws_s3_bucket_policy" "frontend" {
        id     = "care-shift-v3-frontend-079760567374"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::079760567374:distribution/E1ESAJ6Y0HJ7G0"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::care-shift-v3-frontend-079760567374/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```